In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('mls_salaries.csv').dropna(how="all")

In [3]:
df1.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 614 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 33.6+ KB

In [5]:
df1['position'].nunique()

10

In [6]:
df1['position'].value_counts()

M      206
D      182
F      108
GK      64
M-F     18
D-M     14
F-M      6
M-D      4
M/F      1
F/M      1
Name: position, dtype: int64

In [7]:
df1['positionposition'].unique()

array(['M', 'D', 'F', nan, 'GK', 'F-M', 'D-M', 'M-F', 'M-D', 'M/F', 'F/M'],
      dtype=object)

In [8]:
var = list(df1['position'].unique())

In [9]:
var

['M', 'D', 'F', nan, 'GK', 'F-M', 'D-M', 'M-F', 'M-D', 'M/F', 'F/M']

In [11]:
df1['base_salary'] = df1['base_salary'].astype("int")

In [13]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 614 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    int32
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(1), int32(1), object(4)
memory usage: 31.2+ KB

In [14]:
df1['position'] = df1['position'].astype("category")

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 614 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    category
 4   base_salary              614 non-null    int32
 5   guaranteed_compensation  614 non-null    float64
dtypes: category(1), float64(1), int32(1), object(3)
memory usage: 27.4+ KB

In [16]:
df1.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500,2297000.00
1,ATL,Ambrose,Mikey,D,65625,65625.00
2,ATL,Asad,Yamil,M,150000,150000.00
3,ATL,Bloom,Mark,D,99225,106573.89
4,ATL,Carleton,Andrew,F,65000,77400.00
5,ATL,Carmona,Carlos,M,675000,725000.00
6,ATL,Garza,Greg,D,150000,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008,285008.00
8,ATL,Goslin,Chris,M,70000,74000.00
9,ATL,Gressel,Julian,NaN,75000,93750.00

In [17]:
df1.nunique()

club                        23
last_name                  567
first_name                 391
position                    10
base_salary                235
guaranteed_compensation    419
dtype: int64

In [18]:
df1['position'].nunique()

10

In [19]:
df = pd.read_csv('employee.csv')

In [20]:
df.head()

  first_name   last_name  salary  start_date    gender  remote         team
0    Haleigh  Calderhead  334473    5/9/2020       NaN    True   management
1    Coretta      McEvon  637457   3/20/2020      Male   False  engineering
2   Clarette     Tarbett  977749  11/22/2020   Agender    True  engineering
3      Jaime  Gianneschi  253523    9/2/2020  Bigender   False    marketing
4      Ediva     Skelton  325185    2/4/2020    Female    True    marketing

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  1000 non-null   object
 1   last_name   1000 non-null   object
 2   salary      1000 non-null   int64
 3   start_date  976 non-null    object
 4   gender      966 non-null    object
 5   remote      1000 non-null   bool
 6   team        1000 non-null   object
dtypes: bool(1), int64(1), object(5)
memory usage: 48.0+ KB

In [22]:
pd.to_datetime(df['start_date'])

0     2020-05-09
1     2020-03-20
2     2020-11-22
3     2020-09-02
4     2020-02-04
         ...
995   2020-10-18
996   2020-12-28
997   2020-10-26
998   2020-09-08
999   2020-03-29
Name: start_date, Length: 1000, dtype: datetime64[ns]

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  1000 non-null   object
 1   last_name   1000 non-null   object
 2   salary      1000 non-null   int64
 3   start_date  976 non-null    object
 4   gender      966 non-null    object
 5   remote      1000 non-null   bool
 6   team        1000 non-null   object
dtypes: bool(1), int64(1), object(5)
memory usage: 48.0+ KB

In [24]:
df['start_date'] = pd.to_datetime(df['start_date'])

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  1000 non-null   object
 1   last_name   1000 non-null   object
 2   salary      1000 non-null   int64
 3   start_date  976 non-null    datetime64[ns]
 4   gender      966 non-null    object
 5   remote      1000 non-null   bool
 6   team        1000 non-null   object
dtypes: bool(1), datetime64[ns](1), int64(1), object(4)
memory usage: 48.0+ KB

In [29]:
df3 = pd.read_csv('employee.csv',parse_dates=['start_date'])

In [31]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  1000 non-null   object
 1   last_name   1000 non-null   object
 2   salary      1000 non-null   int64
 3   start_date  976 non-null    datetime64[ns]
 4   gender      966 non-null    object
 5   remote      1000 non-null   bool
 6   team        1000 non-null   object
dtypes: bool(1), datetime64[ns](1), int64(1), object(4)
memory usage: 48.0+ KB